# Make sure we’re using the latest Homebrew
update

# Upgrade any already-installed formula
upgrade

# Taps
tap 'homebrew/cask-fonts'

# Install tools
brew 'ack'
brew 'ansible'
brew 'brew-cask-completion'
brew 'cowsay'
brew 'csshx'
brew 'ctop'
brew 'curl'
brew 'docker-clean'
brew 'fasd'
brew 'fortune'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'htop'
brew 'kubernetes-cli'
brew 'less'
brew 'lolcat'
brew 'mackup'
brew 'mas'
brew 'n'
brew 'nano'
brew 'neofetch'
brew 'prettyping'
brew 'screen'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'wget'
Brew 'vim'
brew 'youtube-dl'

# Applications
cask 'alfred'
cask 'bartender'
cask 'betterzipql'
cask 'cakebrew'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'itsycal'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown' 
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'sequel-pro'
cask 'spectacle'
cask 'spotify'
cask 'suspicious-package'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'viscosity'
cask 'vlc'
cask 'webp-quicklook'


# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-comfortaa'
cask 'font-hack'
cask 'font-nexa'
cask 'font-montserrat'
cask 'font-victor-mono'
cask 'font-3270-nerd-font-mono'

# App store
mas 425424353 # Unarchiver
mas 803453959 # Slack
mas 409203825 # Numbers
mas 409201541 # Pages
mas 409183694 # Keynote
mas 1020812363 # Copyclip

# Remove outdated versions from the cellar
cleanup
